<?php

$months = [
    "1" => "Январь", "2" => "Февраля", "3" => "Март",
    "4" => "Апрель", "5" => "Май", "6" => "Июнь",
    "7" => "Июль", "8" => "Август", "9" => "Сентябрь",
    "10" => "Октябрь", "11" => "Ноябрь", "12" => "Декабрь"
];

$days = [
    "1" => 'Понедельник', "2" => 'Вторник', "3" => 'Среда',
    "4" => 'Четверг', "5" => 'Пятница', "6" => 'Суббота', "7" => 'Воскресенье'
];

$repMonth = date("n");
$repDays = date("N");

$dateFormat = date("d $months[$repMonth] Y ($days[$repDays])");
